Repository: Tiritibambix/ImaGUIck
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr, ja

source: No file selected
fr: Aucun fichier sélectionné
ja: ファイルが選択されていません

source: Please select at least one file
fr: Veuillez sélectionner au moins un fichier
ja: 少なくとも1つのファイルを選択してください

source: No valid files were uploaded
fr: Aucun fichier valide n'a été téléchargé

source: Upload Images
fr: Importer des images
ja: 画像をアップロード

source: Drag and drop files here, or click to select files
fr: Glissez et déposez vos fichiers ici, ou cliquez pour sélectionner
ja: ここにファイルをドラッグ＆ドロップ、またはクリックして選択

source: Upload
fr: Importer
ja: アップロード

source: Upload Image by URL
fr: Importer une image depuis une URL
ja: URLから画像をアップロード

source: Enter image URL
fr: Entrez l'URL de l'image
ja: 画像URLを入力

source: Download and Upload
fr: Télécharger et importer
ja: ダウンロードしてアップロード

source: Keep original format
fr: Conserver le format d'origine
ja: 元の形式を維持

source: Recommended formats
fr: Formats recommandés
ja: 推奨フォーマット

source: Other compatible formats
fr: Autres formats compatibles
ja: その他の互換フォーマット

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

source: Spanish
fr: Espagnol

source: Japanese
fr: Japonais

source: Chinese (Simplified)
fr: Chinois (Simplifié)

source: Resize Image: %(filename)s
fr: Redimensionner l'image : %(filename)s

source: Resize by Pixels
fr: Redimensionner en pixels

source: Width:
fr: Largeur :

source: Enter width
fr: Entrez la largeur

source: Height:
fr: Hauteur :

source: Enter height
fr: Entrez la hauteur

source: Keep Aspect Ratio
fr: Conserver les proportions

source: Original dimensions: %(width)s x %(height)s pixels
fr: Dimensions originales : %(width)s x %(height)s pixels

source: Resize by Percentage
fr: Redimensionner en pourcentage

source: Percentage:
fr: Pourcentage :

source: Enter percentage (1-100)
fr: Entrez le pourcentage (1-100)

source: Additional Options
fr: Options supplémentaires

source: Quality (1-100):
fr: Qualité (1-100) :

source: Convert to format:
fr: Convertir au format :

source: Convert all to format:
fr: Convertir tous au format :

source: Best for transparency
fr: Idéal pour la transparence
ja: 透過に最適

source: Best for photos
fr: Idéal pour les photos
ja: 写真に最適

source: Best for graphics
fr: Idéal pour les graphiques
ja: グラフィックに最適

source: This image contains transparency.
fr: Cette image contient de la transparence.

source: This appears to be a photographic image.
fr: Cette image semble être une photographie.

source: This appears to be a graphic image.
fr: Cette image semble être un graphique.

source: Resize
fr: Redimensionner

source: Batch Resize
fr: Redimensionnement par lot

source: Resize All
fr: Tout redimensionner

source: Resize Options
fr: Options de redimensionnement

source: Keep Original Formats
fr: Conserver les formats d'origine

source: Recommended Formats
fr: Formats recommandés

source: Other Compatible Formats
fr: Autres formats compatibles

source: Your batch contains:
fr: Votre lot contient :

source: Images with transparency
fr: Images avec transparence

source: Photographic images
fr: Images photographiques

source: Graphic images
fr: Images graphiques

source: Details for each image:
fr: Détails pour chaque image :

source: Contains transparency
fr: Contient de la transparence

source: Photographic image
fr: Image photographique

source: Graphic image
fr: Image graphique

source: Image processed successfully: %(filename)s
fr: Image traitée avec succès : %(filename)s

source: Error processing image: %(error)s
fr: Erreur lors du traitement de l'image : %(error)s

source: Error downloading image: %(error)s
fr: Erreur lors du téléchargement de l'image : %(error)s

source: Image downloaded successfully: %(filename)s
fr: Image téléchargée avec succès : %(filename)s

source: Error getting image dimensions: %(error)s
fr: Erreur lors de la récupération des dimensions de l'image : %(error)s

source: Could not parse dimensions from output: %(output)s
fr: Impossible d'analyser les dimensions de la sortie : %(output)s
